---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType.Straight
enum: Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType
source: html/92c3fafa-996d-cca9-cc7e-a73d4c94ae57.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType.Straight

Refers to the end of the straight part of the segment: the point where
 the bend begins.